In [1]:
import numpy as np
import pandas as pd

pd.set_option("display.max.columns", 100)
# to draw pictures in jupyter notebook
%matplotlib inline
# we don't like warnings
# you can comment the following 2 lines if you'd like to
import warnings

import matplotlib.pyplot as plt
import seaborn as sns

warnings.filterwarnings("ignore")

In [3]:
data = pd.read_csv(r"C:\Users\mi\MLcourse\mlcourse.ai\data\adult.data.csv")
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [4]:
data['sex'].value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

In [16]:
data.loc[data['sex'] == 'Female', 'age'].mean()

36.85823043357163

In [18]:
(data['native-country'] == 'Germany').sum()

137

In [19]:
data.shape[0]

32561

In [15]:
137/32561

0.004207487485028101

In [30]:
data.loc[data['salary'] == "<=50K", 'age'].mean()

36.78373786407767

In [31]:
data.loc[data['salary'] == "<=50K", 'age'].std()

14.02008849082488

In [33]:
data.loc[data['salary'] == ">50K", 'age'].mean()

44.24984058155847

In [32]:
data.loc[data['salary'] == ">50K", 'age'].std()

10.519027719851826

In [35]:
data.loc[data['salary'] == ">50K", 'education'].value_counts()

Bachelors       2221
HS-grad         1675
Some-college    1387
Masters          959
Prof-school      423
Assoc-voc        361
Doctorate        306
Assoc-acdm       265
10th              62
11th              60
7th-8th           40
12th              33
9th               27
5th-6th           16
1st-4th            6
Name: education, dtype: int64

In [46]:
for (race, sex), sub_df in data.groupby(['race', 'sex']):
    print("Race: {}, sex: {}".format(race, sex))
    print(sub_df['age'].max())

Race: Amer-Indian-Eskimo, sex: Female
80
Race: Amer-Indian-Eskimo, sex: Male
82
Race: Asian-Pac-Islander, sex: Female
75
Race: Asian-Pac-Islander, sex: Male
90
Race: Black, sex: Female
90
Race: Black, sex: Male
90
Race: Other, sex: Female
74
Race: Other, sex: Male
77
Race: White, sex: Female
90
Race: White, sex: Male
90

In [47]:
data['marital-status'].unique()

array(['Never-married', 'Married-civ-spouse', 'Divorced',
       'Married-spouse-absent', 'Separated', 'Married-AF-spouse',
       'Widowed'], dtype=object)

In [61]:
for (sex, status), sub_df in data.groupby(['sex', 'marital-status']):
    print("Sex: {}, status: {}".format(sex, status))
    print(sub_df['salary'].value_counts())

Sex: Female, status: Divorced
<=50K    2493
>50K      179
Name: salary, dtype: int64
Sex: Female, status: Married-AF-spouse
<=50K    8
>50K     6
Name: salary, dtype: int64
Sex: Female, status: Married-civ-spouse
<=50K    903
>50K     754
Name: salary, dtype: int64
Sex: Female, status: Married-spouse-absent
<=50K    194
>50K      11
Name: salary, dtype: int64
Sex: Female, status: Never-married
<=50K    4601
>50K      166
Name: salary, dtype: int64
Sex: Female, status: Separated
<=50K    614
>50K      17
Name: salary, dtype: int64
Sex: Female, status: Widowed
<=50K    779
>50K      46
Name: salary, dtype: int64
Sex: Male, status: Divorced
<=50K    1487
>50K      284
Name: salary, dtype: int64
Sex: Male, status: Married-AF-spouse
<=50K    5
>50K     4
Name: salary, dtype: int64
Sex: Male, status: Married-civ-spouse
<=50K    7381
>50K     5938
Name: salary, dtype: int64
Sex: Male, status: Married-spouse-absent
<=50K    190
>50K      23
Name: salary, dtype: int64
Sex: Male, status: Never-married
<=50K    5591
>50K      325
Name: salary, dtype: int64
Sex: Male, status: Separated
<=50K    345
>50K      49
Name: salary, dtype: int64
Sex: Male, status: Widowed
<=50K    129
>50K      39
Name: salary, dtype: int64

In [63]:
#Married man
4+5938+23

5965

In [64]:
# Single man
284+325+49+39

697

In [60]:
data.loc[(data['sex'] == 'Male') &
     (data['marital-status'].isin(['Never-married', 
                                   'Separated', 
                                   'Divorced',
                                   'Widowed'])), 'salary'].value_counts()

<=50K    7552
>50K      697
Name: salary, dtype: int64

In [62]:
data.loc[(data['sex'] == 'Male') &
     (data['marital-status'].str.startswith('Married')), 'salary'].value_counts()

<=50K    7576
>50K     5965
Name: salary, dtype: int64

In [67]:
data['hours-per-week'].max()

99

In [70]:
data.loc[data['hours-per-week'] == 99].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 85 entries, 935 to 32531
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             85 non-null     int64
 1   workclass       85 non-null     object
 2   fnlwgt          85 non-null     int64
 3   education       85 non-null     object
 4   education-num   85 non-null     int64
 5   marital-status  85 non-null     object
 6   occupation      85 non-null     object
 7   relationship    85 non-null     object
 8   race            85 non-null     object
 9   sex             85 non-null     object
 10  capital-gain    85 non-null     int64
 11  capital-loss    85 non-null     int64
 12  hours-per-week  85 non-null     int64
 13  native-country  85 non-null     object
 14  salary          85 non-null     object
dtypes: int64(6), object(9)
memory usage: 10.6+ KB

In [71]:
data.loc[(data['hours-per-week'] == 99) & 
        (data['salary'] == '>50K')].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 25 entries, 935 to 31681
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             25 non-null     int64
 1   workclass       25 non-null     object
 2   fnlwgt          25 non-null     int64
 3   education       25 non-null     object
 4   education-num   25 non-null     int64
 5   marital-status  25 non-null     object
 6   occupation      25 non-null     object
 7   relationship    25 non-null     object
 8   race            25 non-null     object
 9   sex             25 non-null     object
 10  capital-gain    25 non-null     int64
 11  capital-loss    25 non-null     int64
 12  hours-per-week  25 non-null     int64
 13  native-country  25 non-null     object
 14  salary          25 non-null     object
dtypes: int64(6), object(9)
memory usage: 3.1+ KB

In [72]:
25/85

0.29411764705882354

In [86]:
for (country, salary), sub_df in data.groupby(['native-country', 'salary']):
    print(country, salary, round(sub_df['hours-per-week'].mean(), 2))

? <=50K 40.16
? >50K 45.55
Cambodia <=50K 41.42
Cambodia >50K 40.0
Canada <=50K 37.91
Canada >50K 45.64
China <=50K 37.38
China >50K 38.9
Columbia <=50K 38.68
Columbia >50K 50.0
Cuba <=50K 37.99
Cuba >50K 42.44
Dominican-Republic <=50K 42.34
Dominican-Republic >50K 47.0
Ecuador <=50K 38.04
Ecuador >50K 48.75
El-Salvador <=50K 36.03
El-Salvador >50K 45.0
England <=50K 40.48
England >50K 44.53
France <=50K 41.06
France >50K 50.75
Germany <=50K 39.14
Germany >50K 44.98
Greece <=50K 41.81
Greece >50K 50.62
Guatemala <=50K 39.36
Guatemala >50K 36.67
Haiti <=50K 36.33
Haiti >50K 42.75
Holand-Netherlands <=50K 40.0
Honduras <=50K 34.33
Honduras >50K 60.0
Hong <=50K 39.14
Hong >50K 45.0
Hungary <=50K 31.3
Hungary >50K 50.0
India <=50K 38.23
India >50K 46.48
Iran <=50K 41.44
Iran >50K 47.5
Ireland <=50K 40.95
Ireland >50K 48.0
Italy <=50K 39.62
Italy >50K 45.4
Jamaica <=50K 38.24
Jamaica >50K 41.1
Japan <=50K 41.0
Japan >50K 47.96
Laos <=50K 40.38
Laos >50K 40.0
Mexico <=50K 40.0
Mexico >50K 46.58
Nicaragua <=50K 36.09
Nicaragua >50K 37.5
Outlying-US(Guam-USVI-etc) <=50K 41.86
Peru <=50K 35.07
Peru >50K 40.0
Philippines <=50K 38.07
Philippines >50K 43.03
Poland <=50K 38.17
Poland >50K 39.0
Portugal <=50K 41.94
Portugal >50K 41.5
Puerto-Rico <=50K 38.47
Puerto-Rico >50K 39.42
Scotland <=50K 39.44
Scotland >50K 46.67
South <=50K 40.16
South >50K 51.44
Taiwan <=50K 33.77
Taiwan >50K 46.8
Thailand <=50K 42.87
Thailand >50K 58.33
Trinadad&Tobago <=50K 37.06
Trinadad&Tobago >50K 40.0
United-States <=50K 38.8
United-States >50K 45.51
Vietnam <=50K 37.19
Vietnam >50K 39.2
Yugoslavia <=50K 41.6
Yugoslavia >50K 49.5